using Tyuiu.GridinAE.Sprint4.Task3.V23.Lib;

Console.Title = "Спринт #4 | Выполнил: Гридин А. Е. | ИИПБ-24-2";
Console.WriteLine("************************************************************************");
Console.WriteLine("* Спринт #4                                                            *");
Console.WriteLine("* Тема: Двумерные массивы (статический ввод)                           *");
Console.WriteLine("* Задание #3                                                           *");
Console.WriteLine("* Вариант #23                                                          *");
Console.WriteLine("* Выполнил: Гридин Артём Евгеньевич | ИИПБ-24-2                        *");
Console.WriteLine("************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                             *");
Console.WriteLine("* Дан двумерный целочисленный массив 5 на 5 элементов, заполненный     *");
Console.WriteLine("* статическими значениями в диапазоне от 2 до 8. Подсчитайте           *");
Console.WriteLine("* количество четных элементов во всем массиве.                         *");
Console.WriteLine("************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                           *");
Console.WriteLine("************************************************************************");

int[,] array = new int[,]
{
    { 7, 5, 5, 6, 7 },
    { 8, 7, 8, 4, 3 },
    { 5, 6, 7, 8, 3 },
    { 4, 2, 3, 6, 4 },
    { 5, 2, 4, 2, 3 }
};

Console.WriteLine(new DataService().Calculate(array));
Console.ReadKey();